# 필요 데이터 선택하기

In [2]:
import pandas as pd
import numpy as np

flight = pd.read_csv("./flight_price_prediction/Clean_Dataset.csv",encoding='cp949')
flight

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

### 특정 칼럼을 기준으로 데이터 프레임의 데이터 추출하기

In [3]:
flight['departure_time']

0               Evening
1         Early_Morning
2         Early_Morning
3               Morning
4               Morning
              ...
300148          Morning
300149        Afternoon
300150    Early_Morning
300151    Early_Morning
300152          Morning
Name: departure_time, Length: 300153, dtype: object

In [4]:
flight[['airline', 'departure_time', 'source_city']]

         airline departure_time source_city
0       SpiceJet        Evening       Delhi
1       SpiceJet  Early_Morning       Delhi
2        AirAsia  Early_Morning       Delhi
3        Vistara        Morning       Delhi
4        Vistara        Morning       Delhi
...          ...            ...         ...
300148   Vistara        Morning     Chennai
300149   Vistara      Afternoon     Chennai
300150   Vistara  Early_Morning     Chennai
300151   Vistara  Early_Morning     Chennai
300152   Vistara        Morning     Chennai

[300153 rows x 3 columns]

In [5]:
flight[10:21]

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
10,10,GO_FIRST,G8-392,Delhi,Afternoon,zero,Evening,Mumbai,Economy,2.25,1,5954
11,11,GO_FIRST,G8-338,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.33,1,5954
12,12,Indigo,6E-5001,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.17,1,5955
13,13,Indigo,6E-6202,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.17,1,5955
14,14,Indigo,6E-549,Delhi,Afternoon,zero,Evening,Mumbai,Economy,2.25,1,5955
15,15,Indigo,6E-6278,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
16,16,Air_India,AI-887,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.08,1,5955
17,17,Air_India,AI-665,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.17,1,5955
18,18,AirAsia,I5-747,Delhi,Evening,one,Early_Morning,Mumbai,Economy,12.25,1,5949
19,19,AirAsia,I5-747,Delhi,Evening,one,Morning,Mumbai,Economy,16.33,1,5949
20,20,GO_FIRST,G8-266,Delhi,Early_Morning,one,Evening,Mumbai,Economy,11.75,1,5954

### 특정 행, 열의 범위를 선택해서 데이터 선택하기

|loc|iloc|
|:---|:---|
|데이터프레임의 행이나 열에 "레이블"로 접근|데이터프레임의 행이나 열에 "인덱스" 값으로 접근
|인덱스 및 칼럼명을 통해 지정하는 방법|인덱스를 활용해 지정하는 방법|
|설정한 인덱스 그대로 사용|0 based index로 사용|

In [6]:
flight.shape

(300153, 12)

In [7]:
flight.index = np.arange(100, 300253)
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
100,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
101,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
102,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
103,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
104,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

In [8]:
flight.loc[[102, 202, 302]]

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
102,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
202,102,Vistara,UK-819,Delhi,Afternoon,one,Night,Mumbai,Economy,6.00,1,18923
302,202,Vistara,UK-879,Delhi,Evening,one,Night,Mumbai,Economy,5.33,2,13673

In [9]:
flight.iloc[[2, 102, 202]]

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
102,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
202,102,Vistara,UK-819,Delhi,Afternoon,one,Night,Mumbai,Economy,6.00,1,18923
302,202,Vistara,UK-879,Delhi,Evening,one,Night,Mumbai,Economy,5.33,2,13673

In [10]:
flight.loc[[102,202,302],['airline', 'flight','source_city','price']]

     airline  flight source_city  price
102  AirAsia  I5-764       Delhi   5956
202  Vistara  UK-819       Delhi  18923
302  Vistara  UK-879       Delhi  13673

In [11]:
# flight.iloc[[2,102,202],['airline', 'flight','source_city','price']]
# iloc은 모든 것을 index no로 해결해야 한다.
flight.iloc[[2,102,202],[1,2,3,11]]

     airline  flight source_city  price
102  AirAsia  I5-764       Delhi   5956
202  Vistara  UK-819       Delhi  18923
302  Vistara  UK-879       Delhi  13673

In [12]:
flight = pd.read_csv("./flight_price_prediction/Clean_Dataset.csv", encoding='cp949')
flight.head()
flight.shape

(300153, 12)

### 조건 : price가 12000 초과이고, airline이 Air_india인 항목만 추출

In [13]:
flight_extract = flight[(flight['price'] > 12000) & (flight['airline'] == 'Air_India')]
flight_extract.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
40,40,Air_India,AI-504,Delhi,Night,one,Morning,Mumbai,Economy,11.00,1,12150
41,41,Air_India,AI-502,Delhi,Afternoon,one,Morning,Mumbai,Economy,19.08,1,12150
42,42,Air_India,AI-506,Delhi,Morning,one,Morning,Mumbai,Economy,22.83,1,12150
43,43,Air_India,AI-803,Delhi,Early_Morning,one,Morning,Mumbai,Economy,26.42,1,12150
44,44,Air_India,AI-479,Delhi,Night,one,Afternoon,Mumbai,Economy,17.75,1,12215

### 조건을 자주 변경하거나, 조건이 너무 많으면 복잡할 수 있으니 조건을 변수로 저장해서 사용할 수도 있음

In [14]:
price_Tag = flight['price'] > 12000
airline_tag = flight['airline'] == 'Air_India'
price_Tag.head(), airline_tag.head()

(0    False
 1    False
 2    False
 3    False
 4    False
 Name: price, dtype: bool,
 0    False
 1    False
 2    False
 3    False
 4    False
 Name: airline, dtype: bool)

In [15]:
flight_extract2 = flight[price_Tag & airline_tag].head()
flight_extract2

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
40,40,Air_India,AI-504,Delhi,Night,one,Morning,Mumbai,Economy,11.00,1,12150
41,41,Air_India,AI-502,Delhi,Afternoon,one,Morning,Mumbai,Economy,19.08,1,12150
42,42,Air_India,AI-506,Delhi,Morning,one,Morning,Mumbai,Economy,22.83,1,12150
43,43,Air_India,AI-803,Delhi,Early_Morning,one,Morning,Mumbai,Economy,26.42,1,12150
44,44,Air_India,AI-479,Delhi,Night,one,Afternoon,Mumbai,Economy,17.75,1,12215

# 필요 데이터 변경하기

In [16]:
flight['price2'] = flight['price']*2
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,price2
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,11906
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,11906
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,11912
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,11910
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,11910

In [17]:
flight['price3'] = flight['price'] + flight['price2']
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price,price2,price3
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953,11906,17859
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955,11910,17865

### insert 함수를 사용해 "원하는 위치에 칼럼 생성"하기

df.insert(loc, column, value, allow_duplicates=False)  
-loc : 삽입될 열의 위치  
-column : 삽입 될 열의 이름  
-value : 삽입될 열의 값  
-allow_duplicates : 기본값은 False, True인 경우 중복 열의 삽입을 허용

In [18]:
flight.insert(10, 'duration2', flight['duration']*10)
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906,17859
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865

### 데이터 삭제하기
axis=1 : 열 레벨로 데이터를 삭제함  
axis=0 : 행 레벨로 데이터를 삭제함

In [19]:
flight.drop('price3', axis=1).head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910

In [20]:
flight.drop(index=0, axis=0).head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865
5,5,Vistara,UK-945,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.33,23.3,1,5955,11910,17865

### 그냥 drop으로는 원본 DataFrame에 영향을 줄 수 없다.

In [21]:
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906,17859
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865

In [22]:
# 새로운 변수를 만들어서 할당하던지
flight1 = flight.drop('price3', axis=1)
flight1.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910

In [23]:
from copy import copy
flight2 = copy(flight)
flight2.drop('price3', axis=1, inplace=True)
flight2.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910

### 칼럼 이름 변경하기
rename method를 활용해 데이터 칼럼 이름 변경하기  
columns에 {"변경전 이름": 변경 후 이름, "변경전 이름": "변경 후 이름} 이렇게 넣어야 한다.

In [24]:
flight.rename(columns={'airline':'airline_name','source_city':'departure_city'}, inplace=True)
flight.head()

,Unnamed: 0,airline_name,flight,departure_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906,17859
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865

### 데이터프레임 정렬하기
원하는 칼럼을 기준으로 데이터프레임을 정렬하여 조회하는 방법  
sort_values  
예:)  
flight.sort_values(by='Unnamed: 0', ascending=False).head()  
Unnamed: 0 칼럼을 기준으로, 내림차순으로 정렬한다.

In [25]:
flight.sort_values(by='Unnamed: 0', ascending=False, inplace=True)
flight

,Unnamed: 0,airline_name,flight,departure_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,100.8,49,81585,163170,244755
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,100.0,49,81585,163170,244755
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,138.3,49,79099,158198,237297
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,104.2,49,77105,154210,231315
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,100.8,49,69265,138530,207795
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906,17859

In [26]:
flight.sort_values(by='Unnamed: 0', ascending=True, inplace=True)
flight

,Unnamed: 0,airline_name,flight,departure_city,departure_time,stops,arrival_time,destination_city,class,duration,duration2,days_left,price,price2,price3
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,21.7,1,5953,11906,17859
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5953,11906,17859
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,21.7,1,5956,11912,17868
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,22.5,1,5955,11910,17865
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,23.3,1,5955,11910,17865
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,100.8,49,69265,138530,207795
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,104.2,49,77105,154210,231315
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,138.3,49,79099,158198,237297
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,100.0,49,81585,163170,244755
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,100.8,49,81585,163170,244755

# 데이터프레임 변형하기

데이터프레임 자체를 변형해 원하는 데이터를 만들 수 있다.

In [27]:
flight = pd.read_csv("./flight_price_prediction/Clean_Dataset.csv", encoding='cp949')
flight.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955

### 그룹화하기
groupby  
데이터프레임의 같은 값을 하나로 묶어 통계나 집계 결과를 확인하기 위해 사용한다.  
아래 과정을 거쳐 그룹화한다.
- Split : 그룹별로 데이터를 나눈다.
- Apply : 각 그룹별로 집계 함수를 적용한다.
- Combine : 그룹별 집계 결과를 하나로 합친다.

In [28]:
airline_group = flight.groupby('airline')
airline_group

In [29]:
airline_group.groups

{'AirAsia': [2, 18, 19, 27, 48, 141, 147, 148, 157, 265, 290, 325, 435, 450, 608, 609, 623, 706, 746, 782, 783, 784, 814, 978, 993, 1085, 1088, 1133, 1210, 1248, 1261, 1284, 1323, 1341, 1343, 1461, 1466, 1483, 1526, 1583, 1685, 1693, 1694, 1695, 1696, 1697, 1698, 1699, 1700, 1701, 1728, 1759, 1760, 1761, 1762, 1866, 1911, 1912, 1913, 1914, 1915, 1916, 1917, 1947, 1972, 1974, 1976, 1977, 1991, 1992, 2083, 2127, 2128, 2129, 2130, 2131, 2132, 2133, 2134, 2135, 2167, 2194, 2196, 2264, 2265, 2292, 2305, 2350, 2351, 2352, 2353, 2354, 2355, 2397, 2422, 2423, 2443, 2444, 2465, 2484, ...], 'Air_India': [16, 17, 23, 37, 40, 41, 42, 43, 44, 49, 50, 51, 52, 53, 60, 71, 74, 75, 82, 86, 87, 96, 98, 107, 108, 110, 113, 114, 115, 117, 142, 143, 144, 145, 146, 151, 152, 162, 163, 164, 166, 168, 173, 182, 189, 191, 193, 195, 196, 197, 198, 199, 207, 211, 223, 225, 229, 236, 237, 241, 242, 243, 247, 250, 266, 267, 268, 269, 272, 280, 291, 295, 303, 309, 314, 315, 316, 319, 321, 329, 333, 343, 352, 357, 361, 362, 363, 372, 376, 379, 380, 381, 385, 387, 388, 390, 391, 392, 393, 394, ...], 'GO_FIRST': [8, 9, 10, 11, 20, 21, 22, 30, 68, 72, 101, 112, 126, 127, 128, 129, 130, 131, 149, 150, 200, 201, 208, 212, 213, 222, 232, 235, 244, 245, 257, 258, 259, 260, 270, 271, 277, 278, 281, 296, 312, 313, 317, 327, 328, 342, 366, 368, 371, 384, 389, 413, 414, 415, 416, 417, 418, 436, 437, 438, 439, 440, 441, 442, 455, 465, 469, 490, 491, 496, 497, 535, 552, 586, 587, 588, 589, 590, 591, 610, 611, 612, 613, 614, 615, 616, 617, 627, 639, 640, 646, 668, 669, 672, 673, 675, 691, 762, 763, 764, ...], 'Indigo': [12, 13, 14, 15, 24, 26, 29, 31, 54, 55, 56, 57, 58, 67, 79, 81, 132, 133, 134, 135, 136, 137, 139, 140, 158, 159, 167, 170, 171, 172, 174, 175, 180, 181, 190, 224, 226, 228, 261, 262, 263, 264, 282, 283, 284, 285, 286, 287, 292, 297, 301, 302, 307, 308, 310, 323, 324, 332, 337, 348, 353, 354, 358, 359, 360, 419, 420, 421, 422, 424, 425, 426, 427, 428, 445, 446, 447, 451, 454, 456, 457, 458, 459, 466, 479, 488, 489, 522, 524, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 625, ...], 'SpiceJet': [0, 1, 28, 38, 39, 45, 80, 118, 119, 138, 160, 161, 194, 227, 251, 252, 253, 274, 275, 294, 306, 311, 331, 398, 399, 400, 401, 402, 403, 423, 444, 448, 449, 452, 520, 540, 563, 564, 565, 566, 567, 568, 569, 570, 619, 620, 621, 622, 624, 665, 738, 739, 740, 741, 742, 743, 744, 745, 799, 800, 802, 844, 877, 898, 919, 920, 921, 922, 923, 924, 925, 971, 974, 975, 1049, 1092, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111, 1150, 1155, 1200, 1243, 1281, 1286, 1287, 1288, 1289, 1290, 1291, 1331, 1332, 1368, 1369, 1412, ...], 'Vistara': [3, 4, 5, 6, 7, 25, 32, 33, 34, 35, 36, 46, 47, 59, 61, 62, 63, 64, 65, 66, 69, 70, 73, 76, 77, 78, 83, 84, 85, 88, 89, 90, 91, 92, 93, 94, 95, 97, 99, 100, 102, 103, 104, 105, 106, 109, 111, 116, 120, 121, 122, 123, 124, 125, 153, 154, 155, 156, 165, 169, 176, 177, 178, 179, 183, 184, 185, 186, 187, 188, 192, 202, 203, 204, 205, 206, 209, 210, 214, 215, 216, 217, 218, 219, 220, 221, 230, 231, 233, 234, 238, 239, 240, 246, 248, 249, 254, 255, 256, 273, ...]}

groups로 확인하면 가독성이 구리니, 내부 메소드를 활용해 확인하자.  
- count : 데이터 개수
- size : 집단별 크기
- sum : 데이터의 합
- mean, std, var : 평균, 표준편차, 분산
- min, max : 최솟값, 최댓값

In [30]:
airline_group.count()

,Unnamed: 0,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
airline,,,,,,,,,,,
AirAsia,16098,16098,16098,16098,16098,16098,16098,16098,16098,16098,16098
Air_India,80892,80892,80892,80892,80892,80892,80892,80892,80892,80892,80892
GO_FIRST,23173,23173,23173,23173,23173,23173,23173,23173,23173,23173,23173
Indigo,43120,43120,43120,43120,43120,43120,43120,43120,43120,43120,43120
SpiceJet,9011,9011,9011,9011,9011,9011,9011,9011,9011,9011,9011
Vistara,127859,127859,127859,127859,127859,127859,127859,127859,127859,127859,127859

In [31]:
airline_group.min()

,Unnamed: 0,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
airline,,,,,,,,,,,
AirAsia,2,I5-1228,Bangalore,Afternoon,one,Afternoon,Bangalore,Economy,0.92,1,1105
Air_India,16,AI-401,Bangalore,Afternoon,one,Afternoon,Bangalore,Business,1.00,1,1526
GO_FIRST,8,G8-101,Bangalore,Afternoon,one,Afternoon,Bangalore,Economy,1.00,1,1105
Indigo,12,6E-102,Bangalore,Afternoon,one,Afternoon,Bangalore,Economy,0.83,1,1105
SpiceJet,0,SG-1031,Bangalore,Afternoon,one,Afternoon,Bangalore,Economy,1.00,1,1106
Vistara,3,UK-613,Bangalore,Afternoon,one,Afternoon,Bangalore,Business,1.00,1,1714

In [32]:
# airline_group.mean() 만 하게 되면 오류가 발생한다.
airline_group.mean(numeric_only=True)

              Unnamed: 0   duration  days_left         price
airline
AirAsia     95102.971922   8.941714  27.735184   4091.072742
Air_India  162945.107007  15.504235  25.497466  23507.019112
GO_FIRST    87630.797005   8.755380  27.430415   5652.007595
Indigo     110102.972658   5.795197  26.264309   5324.216303
SpiceJet    91878.408834  12.579767  24.122850   6179.278881
Vistara    177755.288310  13.326634  25.894532  30396.536302

In [33]:
airline_group.mean(numeric_only=True)[['price']]

                  price
airline
AirAsia     4091.072742
Air_India  23507.019112
GO_FIRST    5652.007595
Indigo      5324.216303
SpiceJet    6179.278881
Vistara    30396.536302

복수개의 칼럼을 기준으로 groupby를 사용하면 다중 인덱싱 가능

In [34]:
flight.groupby(['airline', 'arrival_time']).mean(numeric_only=True)
# flight.groupby(['airline', 'arrival_time']).min()

                            Unnamed: 0   duration  days_left         price
airline   arrival_time
AirAsia   Afternoon       88816.983918   7.496335  26.980507   4206.467836
          Early_Morning   99485.108742   9.454591  27.088842   3632.676617
          Evening         80346.891383   8.628675  27.119117   4539.570963
          Late_Night     105201.948725   9.205835  29.071899   3828.437410
          Morning        107012.537642   9.934108  27.857339   3846.900653
          Night           88657.478861   8.740391  27.487202   4320.171700
Air_India Afternoon      162295.572046  15.954563  25.827142  23426.571700
          Early_Morning  138717.490455  17.037971  27.539501  18805.551542
          Evening        166211.387508  15.878056  24.942981  24459.593397
          Late_Night     166665.450239  13.214077  24.301435  28014.163158
          Morning        162496.968910  16.411557  25.655767  22792.180401
          Night          164175.090257  14.230348  25.451735  23683.386323
GO_FIRST  Afternoon       90534.220872   7.510892  27.706789   5511.206937
          Early_Morning   85682.954898  10.148961  27.533457   5537.433272
          Evening         86610.596935   8.284801  27.474795   6022.345547
          Late_Night      90382.433765   7.957369  29.245500   5306.723182
          Morning         84289.646143   9.633676  26.265846   5281.059399
          Night           87864.810293   9.087003  26.971360   5808.054728
Indigo    Afternoon      106570.254921   5.483550  26.018053   5458.553278
          Early_Morning  116218.737879   5.913914  29.270398   4107.122586
          Evening        113633.002071   6.255353  25.200587   5914.292555
          Late_Night     110790.778003   5.652350  27.798553   4989.383792
          Morning         93504.652953   4.389309  26.835436   4558.313037
          Night          114668.999528   6.176535  26.114164   5371.779781
SpiceJet  Afternoon       96337.994076  14.371315  25.279621   7116.303318
          Early_Morning   86212.106796  13.395576  20.773925   5348.022191
          Evening         97825.642908  13.826714  24.349964   7465.200285
          Late_Night     125755.550439   7.612829  23.339912   5911.436404
          Morning         88454.211881  12.866352  24.699010   5777.899010
          Night           87037.019268  11.825869  24.129980   5898.403658
Vistara   Afternoon      176534.776824  12.114402  25.469405  27905.873134
          Early_Morning  178997.086816  15.122223  26.597803  28597.738475
          Evening        178147.125191  13.679788  25.935980  31225.269687
          Late_Night     195942.545350  10.051710  26.937031  29699.180243
          Morning        177197.110088  14.913937  25.788161  30180.664694
          Night          177240.740619  12.191358  25.939596  30773.372570

In [35]:
mul_airline_group = flight.groupby(['airline', 'arrival_time'])
mul_airline_group.mean(numeric_only=True).head(18)

                            Unnamed: 0   duration  days_left         price
airline   arrival_time
AirAsia   Afternoon       88816.983918   7.496335  26.980507   4206.467836
          Early_Morning   99485.108742   9.454591  27.088842   3632.676617
          Evening         80346.891383   8.628675  27.119117   4539.570963
          Late_Night     105201.948725   9.205835  29.071899   3828.437410
          Morning        107012.537642   9.934108  27.857339   3846.900653
          Night           88657.478861   8.740391  27.487202   4320.171700
Air_India Afternoon      162295.572046  15.954563  25.827142  23426.571700
          Early_Morning  138717.490455  17.037971  27.539501  18805.551542
          Evening        166211.387508  15.878056  24.942981  24459.593397
          Late_Night     166665.450239  13.214077  24.301435  28014.163158
          Morning        162496.968910  16.411557  25.655767  22792.180401
          Night          164175.090257  14.230348  25.451735  23683.386323
GO_FIRST  Afternoon       90534.220872   7.510892  27.706789   5511.206937
          Early_Morning   85682.954898  10.148961  27.533457   5537.433272
          Evening         86610.596935   8.284801  27.474795   6022.345547
          Late_Night      90382.433765   7.957369  29.245500   5306.723182
          Morning         84289.646143   9.633676  26.265846   5281.059399
          Night           87864.810293   9.087003  26.971360   5808.054728

AirAsia의 Evening 정보만 확인해보기

웬만해서는 [] 쓸 때 두번 감싸주는게 표기상으로 이쁘게 나오네.

In [36]:
flight.groupby(['airline', 'arrival_time']).mean(numeric_only=True).loc[[('AirAsia', 'Evening')]]
# flight.groupby(['airline', 'arrival_time']).min().loc[[('AirAsia', 'Evening')]]

                        Unnamed: 0  duration  days_left        price
airline arrival_time
AirAsia Evening       80346.891383  8.628675  27.119117  4539.570963

### 인덱스로 그룹화하기

set_index : 칼럼을 인덱스로 변경하는 경우에 사용.   
 기존 인덱스를 제거하고, 칼럼중 하나를 인덱스로 설정  
reset_index : 인덱스를 초기화

In [37]:
flight

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [38]:
flight.set_index(['airline', 'arrival_time'])
# 보면, 그냥 순서대로 인덱싱을 한 것에 불과하다.

                        Unnamed: 0   flight source_city departure_time stops  \
airline  arrival_time
SpiceJet Night                   0  SG-8709       Delhi        Evening  zero
         Morning                 1  SG-8157       Delhi  Early_Morning  zero
AirAsia  Early_Morning           2   I5-764       Delhi  Early_Morning  zero
Vistara  Afternoon               3   UK-995       Delhi        Morning  zero
         Morning                 4   UK-963       Delhi        Morning  zero
...                            ...      ...         ...            ...   ...
         Evening            300148   UK-822     Chennai        Morning   one
         Night              300149   UK-826     Chennai      Afternoon   one
         Night              300150   UK-832     Chennai  Early_Morning   one
         Evening            300151   UK-828     Chennai  Early_Morning   one
         Evening            300152   UK-822     Chennai        Morning   one

                       destination_city     class  duration  days_left  price
airline  arrival_time
SpiceJet Night                   Mumbai   Economy      2.17          1   5953
         Morning                 Mumbai   Economy      2.33          1   5953
AirAsia  Early_Morning           Mumbai   Economy      2.17          1   5956
Vistara  Afternoon               Mumbai   Economy      2.25          1   5955
         Morning                 Mumbai   Economy      2.33          1   5955
...                                 ...       ...       ...        ...    ...
         Evening              Hyderabad  Business     10.08         49  69265
         Night                Hyderabad  Business     10.42         49  77105
         Night                Hyderabad  Business     13.83         49  79099
         Evening              Hyderabad  Business     10.00         49  81585
         Evening              Hyderabad  Business     10.08         49  81585

[300153 rows x 10 columns]

In [39]:
flight.set_index(['airline', 'arrival_time']).groupby(level=[0]).mean(numeric_only=True)

              Unnamed: 0   duration  days_left         price
airline
AirAsia     95102.971922   8.941714  27.735184   4091.072742
Air_India  162945.107007  15.504235  25.497466  23507.019112
GO_FIRST    87630.797005   8.755380  27.430415   5652.007595
Indigo     110102.972658   5.795197  26.264309   5324.216303
SpiceJet    91878.408834  12.579767  24.122850   6179.278881
Vistara    177755.288310  13.326634  25.894532  30396.536302

In [40]:
flight.set_index(['airline', 'arrival_time']).groupby(level=[0,1]).mean(numeric_only = True)

                            Unnamed: 0   duration  days_left         price
airline   arrival_time
AirAsia   Afternoon       88816.983918   7.496335  26.980507   4206.467836
          Early_Morning   99485.108742   9.454591  27.088842   3632.676617
          Evening         80346.891383   8.628675  27.119117   4539.570963
          Late_Night     105201.948725   9.205835  29.071899   3828.437410
          Morning        107012.537642   9.934108  27.857339   3846.900653
          Night           88657.478861   8.740391  27.487202   4320.171700
Air_India Afternoon      162295.572046  15.954563  25.827142  23426.571700
          Early_Morning  138717.490455  17.037971  27.539501  18805.551542
          Evening        166211.387508  15.878056  24.942981  24459.593397
          Late_Night     166665.450239  13.214077  24.301435  28014.163158
          Morning        162496.968910  16.411557  25.655767  22792.180401
          Night          164175.090257  14.230348  25.451735  23683.386323
GO_FIRST  Afternoon       90534.220872   7.510892  27.706789   5511.206937
          Early_Morning   85682.954898  10.148961  27.533457   5537.433272
          Evening         86610.596935   8.284801  27.474795   6022.345547
          Late_Night      90382.433765   7.957369  29.245500   5306.723182
          Morning         84289.646143   9.633676  26.265846   5281.059399
          Night           87864.810293   9.087003  26.971360   5808.054728
Indigo    Afternoon      106570.254921   5.483550  26.018053   5458.553278
          Early_Morning  116218.737879   5.913914  29.270398   4107.122586
          Evening        113633.002071   6.255353  25.200587   5914.292555
          Late_Night     110790.778003   5.652350  27.798553   4989.383792
          Morning         93504.652953   4.389309  26.835436   4558.313037
          Night          114668.999528   6.176535  26.114164   5371.779781
SpiceJet  Afternoon       96337.994076  14.371315  25.279621   7116.303318
          Early_Morning   86212.106796  13.395576  20.773925   5348.022191
          Evening         97825.642908  13.826714  24.349964   7465.200285
          Late_Night     125755.550439   7.612829  23.339912   5911.436404
          Morning         88454.211881  12.866352  24.699010   5777.899010
          Night           87037.019268  11.825869  24.129980   5898.403658
Vistara   Afternoon      176534.776824  12.114402  25.469405  27905.873134
          Early_Morning  178997.086816  15.122223  26.597803  28597.738475
          Evening        178147.125191  13.679788  25.935980  31225.269687
          Late_Night     195942.545350  10.051710  26.937031  29699.180243
          Morning        177197.110088  14.913937  25.788161  30180.664694
          Night          177240.740619  12.191358  25.939596  30773.372570

In [41]:
flight.set_index(['airline', 'arrival_time']).groupby(level=[0,1]).aggregate([np.min, np.max])

C:\Users\rnltl\AppData\Local\Temp\ipykernel_21152\2392480525.py:1: FutureWarning: The provided callable <function min at 0x000002686B7B9580> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  flight.set_index(['airline', 'arrival_time']).groupby(level=[0,1]).aggregate([np.min, np.max])
C:\Users\rnltl\AppData\Local\Temp\ipykernel_21152\2392480525.py:1: FutureWarning: The provided callable <function max at 0x000002686B7B9440> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  flight.set_index(['airline', 'arrival_time']).groupby(level=[0,1]).aggregate([np.min, np.max])
C:\Users\rnltl\AppData\Local\Temp\ipykernel_21152\2392480525.py:1: FutureWarning: The provided callable <function min at 0x000002686B7B9580> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  flight.set_index(['airline', 'arrival_time']).groupby(level=[0,1]).aggregate([np.min, np.max])

                        Unnamed: 0           flight          source_city  \
                               min     max      min      max         min
airline   arrival_time
AirAsia   Afternoon             27  202598  I5-1228   I5-942   Bangalore
          Early_Morning          2  193744  I5-1229   I5-996   Bangalore
          Evening            10006  205846  I5-1228   I5-991   Bangalore
          Late_Night          1693  202571  I5-1228   I5-992   Bangalore
          Morning               19  206617  I5-1228   I5-992   Bangalore
          Night               1323  202569  I5-1228   I5-996   Bangalore
Air_India Afternoon             37  299989   AI-402  AI-9937   Bangalore
          Early_Morning       8846  300114   AI-403  AI-9928   Bangalore
          Evening              110  299935   AI-401  AI-9929   Bangalore
          Late_Night           193  295659   AI-401  AI-9929   Bangalore
          Morning               16  300146   AI-401  AI-9929   Bangalore
          Night                 23  300147   AI-401  AI-9991   Bangalore
GO_FIRST  Afternoon             11  206589   G8-101   G8-917   Bangalore
          Early_Morning        150  202069   G8-101   G8-815   Bangalore
          Evening                9  206183   G8-101   G8-917   Bangalore
          Late_Night          1521  197767   G8-102   G8-962   Bangalore
          Morning                8  187519   G8-101   G8-812   Bangalore
          Night                 21  206320   G8-101   G8-917   Bangalore
Indigo    Afternoon             13  206650   6E-113   6E-982   Bangalore
          Early_Morning       1678  206607   6E-134   6E-987   Bangalore
          Evening               14  206614   6E-102   6E-982   Bangalore
          Late_Night           772  206602   6E-126   6E-992   Bangalore
          Morning               12  206610   6E-121   6E-995   Bangalore
          Night                 29  206615   6E-102   6E-998   Bangalore
SpiceJet  Afternoon             45  193244   SG-163  SG-9974   Bangalore
          Early_Morning        275  206184  SG-1031  SG-8803   Bangalore
          Evening              194  203920   SG-197  SG-9911   Bangalore
          Late_Night         10389  187402  SG-1057  SG-8906   Bangalore
          Morning                1  203820  SG-1032  SG-9923   Bangalore
          Night                  0  202067  SG-1062   SG-958   Bangalore
Vistara   Afternoon              3  300133   UK-613   UK-996   Bangalore
          Early_Morning        573  300125   UK-637   UK-995   Bangalore
          Evening                7  300152   UK-613   UK-996   Bangalore
          Late_Night         43306  290332   UK-772   UK-986   Bangalore
          Morning                4  300138   UK-613   UK-996   Bangalore
          Night                 46  300150   UK-613   UK-996   Bangalore

                                 departure_time          stops        \
                             max            min      max   min   max
airline   arrival_time
AirAsia   Afternoon       Mumbai      Afternoon    Night   one  zero
          Early_Morning   Mumbai  Early_Morning    Night   one  zero
          Evening         Mumbai      Afternoon  Morning   one  zero
          Late_Night      Mumbai      Afternoon    Night   one  zero
          Morning         Mumbai  Early_Morning    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero
Air_India Afternoon       Mumbai      Afternoon    Night   one  zero
          Early_Morning   Mumbai      Afternoon    Night   one  zero
          Evening         Mumbai      Afternoon    Night   one  zero
          Late_Night      Mumbai      Afternoon    Night   one  zero
          Morning         Mumbai      Afternoon    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero
GO_FIRST  Afternoon       Mumbai      Afternoon    Night   one  zero
          Early_Morning   Mumbai      Afternoon    Night   one  zero
          Evening         Mumbai      Afternoon  Morning   one  zero
          Late_Night      Mumbai      Afternoon    Night   one  zero
          Morning         Mumbai      Afternoon    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero
Indigo    Afternoon       Mumbai      Afternoon  Morning   one  zero
          Early_Morning   Mumbai  Early_Morning    Night   one  zero
          Evening         Mumbai      Afternoon  Morning   one  zero
          Late_Night      Mumbai      Afternoon    Night   one  zero
          Morning         Mumbai  Early_Morning    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero
SpiceJet  Afternoon       Mumbai      Afternoon    Night   one  zero
          Early_Morning   Mumbai      Afternoon    Night   one  zero
          Evening         Mumbai      Afternoon    Night   one  zero
          Late_Night     Kolkata      Afternoon    Night   one  zero
          Morning         Mumbai      Afternoon    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero
Vistara   Afternoon       Mumbai      Afternoon    Night   one  zero
          Early_Morning   Mumbai      Afternoon    Night   one  zero
          Evening         Mumbai      Afternoon    Night   one  zero
          Late_Night      Mumbai      Afternoon    Night   one  zero
          Morning         Mumbai      Afternoon    Night   one  zero
          Night           Mumbai      Afternoon    Night   one  zero

                        destination_city             class          duration  \
                                     min     max       min      max      min
airline   arrival_time
AirAsia   Afternoon            Bangalore  Mumbai   Economy  Economy     0.92
          Early_Morning          Chennai  Mumbai   Economy  Economy     0.92
          Evening              Bangalore  Mumbai   Economy  Economy     0.92
          Late_Night           Bangalore  Mumbai   Economy  Economy     1.25
          Morning              Bangalore  Mumbai   Economy  Economy     1.00
          Night                Bangalore  Mumbai   Economy  Economy     0.92
Air_India Afternoon            Bangalore  Mumbai  Business  Economy     1.00
          Early_Morning        Bangalore  Mumbai  Business  Economy     1.33
          Evening              Bangalore  Mumbai  Business  Economy     1.50
          Late_Night           Bangalore  Mumbai  Business  Economy     2.58
          Morning              Bangalore  Mumbai  Business  Economy     1.08
          Night                Bangalore  Mumbai  Business  Economy     1.17
GO_FIRST  Afternoon            Bangalore  Mumbai   Economy  Economy     1.00
          Early_Morning        Bangalore  Mumbai   Economy  Economy     1.00
          Evening              Bangalore  Mumbai   Economy  Economy     1.17
          Late_Night           Bangalore  Mumbai   Economy  Economy     1.25
          Morning              Bangalore  Mumbai   Economy  Economy     1.00
          Night                Bangalore  Mumbai   Economy  Economy     1.08
Indigo    Afternoon            Bangalore  Mumbai   Economy  Economy     0.92
          Early_Morning        Bangalore  Mumbai   Economy  Economy     0.83
          Evening              Bangalore  Mumbai   Economy  Economy     0.92
          Late_Night           Bangalore  Mumbai   Economy  Economy     1.17
          Morning              Bangalore  Mumbai   Economy  Economy     0.83
          Night                Bangalore  Mumbai   Economy  Economy     0.83
SpiceJet  Afternoon            Bangalore  Mumbai   Economy  Economy     1.25
          Early_Morning        Bangalore  Mumbai   Economy  Economy     1.00
          Evening              Bangalore  Mumbai   Economy  Economy     1.08
          Late_Night           Bangalore  Mumbai   Economy  Economy     2.50
          Morning              Bangalore  Mumbai   Economy  Economy     1.00
          Night                Bangalore  Mumbai   Economy  Economy     1.75
Vistara   Afternoon            Bangalore  Mumbai  Business  Economy     1.50
          Early_Morning        Bangalore  Mumbai  Business  Economy     1.50
          Evening              Bangalore  Mumbai  Business  Economy     1.00
          Late_Night               Delhi   Delhi  Business  Economy     2.17
          Morning              Bangalore  Mumbai  Business  Economy     1.17
          Night                Bangalore  Mumbai  Business  Economy     1.00

                               days_left     price
                           max       min max   min     max
airline   arrival_time
AirAsia   Afternoon      18.33         1  49  1443   31917
          Early_Morning  15.50         1  49  1603   29501
          Evening        14.58         1  49  1443   31799
          Late_Night     17.33         1  49  1443   31707
          Morning        19.58         1  49  1105   26360
          Night          18.00         1  49  1443   30211
Air_India Afternoon      44.50         1  49  1830   86491
          Early_Morning  40.75         1  49  1776   80762
          Evening        49.83         1  49  1830   84374
          Late_Night     41.58         1  49  3863   89257
          Morning        45.83         1  49  1526   86491
          Night          41.83         1  49  1830   90970
GO_FIRST  Afternoon      17.92         1  49  1105   31773
          Early_Morning  22.50         1  49  1776   25462
          Evening        15.50         1  49  1105   28174
          Late_Night     16.08         1  49  1714   16120
          Morning        20.67         1  49  1714   27620
          Night          17.00         1  49  1714   32803
Indigo    Afternoon      10.92         1  49  1105   29213
          Early_Morning  12.42         1  49  1105   24120
          Evening        12.67         1  49  1105   30786
          Late_Night     12.33         1  49  1105   25086
          Morning        12.50         1  49  1105   24047
          Night          15.42         1  49  1105   31952
SpiceJet  Afternoon      26.33         1  49  1566   20874
          Early_Morning  26.33         1  44  1106   25454
          Evening        27.92         1  49  2491   27769
          Late_Night     19.25         1  49  2568   20298
          Morning        27.50         1  49  1444   34158
          Night          27.58         1  49  2100   26939
Vistara   Afternoon      33.08         1  49  2022  115211
          Early_Morning  26.08         4  49  2074  106416
          Evening        37.58         1  49  1776  117307
          Late_Night     28.33         3  49  2339   83087
          Morning        47.08         1  49  1714  111964
          Night          40.00         1  49  1714  123071

## 피벗 테이블 생성하기

In [42]:
import numpy as np
import pandas as pd
pivot_data = pd.DataFrame({'cust_id': ['cust_1', 'cust_1', 'cust_1', 'cust_2', 'cust_2', 'cust_2', 'cust_3', 'cust_3', 'cust_3'], 
                           'prod_cd' : ['p1', 'p2', 'p3', 'p1', 'p2', 'p3', 'p1', 'p2', 'p3'],
                           'grade': ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'],
                           'purch_amt': [30,10,0,40,15,30,0,0,10]})
pivot_data

  cust_id prod_cd grade  purch_amt
0  cust_1      p1     A         30
1  cust_1      p2     A         10
2  cust_1      p3     A          0
3  cust_2      p1     A         40
4  cust_2      p2     A         15
5  cust_2      p3     A         30
6  cust_3      p1     B          0
7  cust_3      p2     B          0
8  cust_3      p3     B         10

버전이 바뀌었는지, 반드시 index, columns, values를 입력해야 한다.

In [43]:
pivot_data.pivot(index = 'cust_id', columns = 'prod_cd', values='purch_amt')

prod_cd  p1  p2  p3
cust_id
cust_1   30  10   0
cust_2   40  15  30
cust_3    0   0  10

In [44]:
pivot_data.pivot(index='grade', columns='prod_cd', values='purch_amt')

ValueError: Index contains duplicate entries, cannot reshape

In [45]:
pivot_data.pivot_table(index='grade', columns='prod_cd', values='purch_amt')

prod_cd    p1    p2    p3
grade
A        35.0  12.5  15.0
B         0.0   0.0  10.0

In [46]:
pivot_data.pivot_table(index='grade', columns='prod_cd', values='purch_amt', aggfunc='sum')

prod_cd  p1  p2  p3
grade
A        70  25  30
B         0   0  10

## 인덱스 및 칼럼 레벨 변경하기
stack/unstack 메소드 사용 방법 숙달

In [47]:
stack_data = pd.DataFrame({
    'Location': ['Seoul', 'Seoul', 'Seoul', 'kyounggi', 'kyounggi', 'Busan', 'Seoul', 'Seoul', 'Busan', 'kyounggi', 'kyounggi', 'kyounggi'],
    'Day': ['Mon', 'Tue', 'Wed', 'Mon','Tue','Mon','Thu','Fri','Tue','Wed','Thu','Fri'],
    'Ranfall': [100,80,1000,200,200,100,50,100,200,100,50,100],
    'Rainfall_precipitation': [80,70,90,10,20,30,50,90,20,80,50,10],
    'Temp': [32,27,32,31,30,28,27,25,26,33,34,31]
})
stack_data

    Location  Day  Ranfall  Rainfall_precipitation  Temp
0      Seoul  Mon      100                      80    32
1      Seoul  Tue       80                      70    27
2      Seoul  Wed     1000                      90    32
3   kyounggi  Mon      200                      10    31
4   kyounggi  Tue      200                      20    30
5      Busan  Mon      100                      30    28
6      Seoul  Thu       50                      50    27
7      Seoul  Fri      100                      90    25
8      Busan  Tue      200                      20    26
9   kyounggi  Wed      100                      80    33
10  kyounggi  Thu       50                      50    34
11  kyounggi  Fri      100                      10    31

In [48]:
new_stack_data = stack_data.set_index(['Location', 'Day'])
new_stack_data

              Ranfall  Rainfall_precipitation  Temp
Location Day
Seoul    Mon      100                      80    32
         Tue       80                      70    27
         Wed     1000                      90    32
kyounggi Mon      200                      10    31
         Tue      200                      20    30
Busan    Mon      100                      30    28
Seoul    Thu       50                      50    27
         Fri      100                      90    25
Busan    Tue      200                      20    26
kyounggi Wed      100                      80    33
         Thu       50                      50    34
         Fri      100                      10    31

In [49]:
new_stack_data.unstack(0)

         Ranfall                  Rainfall_precipitation                 Temp  \
Location   Busan   Seoul kyounggi                  Busan Seoul kyounggi Busan
Day
Fri          NaN   100.0    100.0                    NaN  90.0     10.0   NaN
Mon        100.0   100.0    200.0                   30.0  80.0     10.0  28.0
Thu          NaN    50.0     50.0                    NaN  50.0     50.0   NaN
Tue        200.0    80.0    200.0                   20.0  70.0     20.0  26.0
Wed          NaN  1000.0    100.0                    NaN  90.0     80.0   NaN


Location Seoul kyounggi
Day
Fri       25.0     31.0
Mon       32.0     31.0
Thu       27.0     34.0
Tue       27.0     30.0
Wed       32.0     33.0

In [50]:
new_stack_data.unstack(1)

         Ranfall                             Rainfall_precipitation        \
Day          Fri    Mon   Thu    Tue     Wed                    Fri   Mon
Location
Busan        NaN  100.0   NaN  200.0     NaN                    NaN  30.0
Seoul      100.0  100.0  50.0   80.0  1000.0                   90.0  80.0
kyounggi   100.0  200.0  50.0  200.0   100.0                   10.0  10.0

                            Temp
Day        Thu   Tue   Wed   Fri   Mon   Thu   Tue   Wed
Location
Busan      NaN  20.0   NaN   NaN  28.0   NaN  26.0   NaN
Seoul     50.0  70.0  90.0  25.0  32.0  27.0  27.0  32.0
kyounggi  50.0  20.0  80.0  31.0  31.0  34.0  30.0  33.0

In [51]:
new_stack_data2 = new_stack_data.unstack(1)
new_stack_data2

         Ranfall                             Rainfall_precipitation        \
Day          Fri    Mon   Thu    Tue     Wed                    Fri   Mon
Location
Busan        NaN  100.0   NaN  200.0     NaN                    NaN  30.0
Seoul      100.0  100.0  50.0   80.0  1000.0                   90.0  80.0
kyounggi   100.0  200.0  50.0  200.0   100.0                   10.0  10.0

                            Temp
Day        Thu   Tue   Wed   Fri   Mon   Thu   Tue   Wed
Location
Busan      NaN  20.0   NaN   NaN  28.0   NaN  26.0   NaN
Seoul     50.0  70.0  90.0  25.0  32.0  27.0  27.0  32.0
kyounggi  50.0  20.0  80.0  31.0  31.0  34.0  30.0  33.0

In [52]:
new_stack_data2.stack(1)

C:\Users\rnltl\AppData\Local\Temp\ipykernel_21152\4002263337.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  new_stack_data2.stack(1)

              Ranfall  Rainfall_precipitation  Temp
Location Day
Busan    Mon    100.0                    30.0  28.0
         Tue    200.0                    20.0  26.0
Seoul    Fri    100.0                    90.0  25.0
         Mon    100.0                    80.0  32.0
         Thu     50.0                    50.0  27.0
         Tue     80.0                    70.0  27.0
         Wed   1000.0                    90.0  32.0
kyounggi Fri    100.0                    10.0  31.0
         Mon    200.0                    10.0  31.0
         Thu     50.0                    50.0  34.0
         Tue    200.0                    20.0  30.0
         Wed    100.0                    80.0  33.0

## 데이터 프레임 병합하기

In [53]:
df1 = pd.DataFrame({'col1':['사과', '배','감','수박','멜론'], 'col2':[500,1000,2500,5000,3000]}, index=[0,1,2,3,4])
df1

  col1  col2
0   사과   500
1    배  1000
2    감  2500
3   수박  5000
4   멜론  3000

In [54]:
# pd.DataFrame({'col1': ['수박','멜론','딸기','키위','오렌지'], 'col2':[5000,3000,1000,600,700]})

In [55]:
df2 = pd.DataFrame({'col1': ['수박','멜론','딸기','키위','오렌지'], 'col2':[5000,3000,1000,600,700]},  index=[3,4,5,6,7])
df2

  col1  col2
3   수박  5000
4   멜론  3000
5   딸기  1000
6   키위   600
7  오렌지   700

In [56]:
pd.concat([df1, df2], ignore_index=False)

  col1  col2
0   사과   500
1    배  1000
2    감  2500
3   수박  5000
4   멜론  3000
3   수박  5000
4   멜론  3000
5   딸기  1000
6   키위   600
7  오렌지   700

In [57]:
pd.concat([df1, df2], ignore_index=True)

  col1  col2
0   사과   500
1    배  1000
2    감  2500
3   수박  5000
4   멜론  3000
5   수박  5000
6   멜론  3000
7   딸기  1000
8   키위   600
9  오렌지   700

In [58]:
pd.concat([df1, df2], axis=1)

  col1    col2 col1    col2
0   사과   500.0  NaN     NaN
1    배  1000.0  NaN     NaN
2    감  2500.0  NaN     NaN
3   수박  5000.0   수박  5000.0
4   멜론  3000.0   멜론  3000.0
5  NaN     NaN   딸기  1000.0
6  NaN     NaN   키위   600.0
7  NaN     NaN  오렌지   700.0

In [59]:
df3 = pd.DataFrame({'item':['item0','item1','item2','item3'], 'count': ['count0', 'count1', 'count2', 'count3'], 'price': ['price0', 'price1', 'price2', 'price3']}, index = [0,1,2,3])
df3

    item   count   price
0  item0  count0  price0
1  item1  count1  price1
2  item2  count2  price2
3  item3  count3  price3

In [60]:
df4 = pd.DataFrame({'item':['item2','item3','item4','item5'], 'count': ['count2', 'count3', 'count4', 'count5'], 'price': ['price2', 'price3', 'price4', 'price5'], 'var': ['var2', 'var3', 'var4', 'var5']}, index=[2,3,4,5])
df4

    item   count   price   var
2  item2  count2  price2  var2
3  item3  count3  price3  var3
4  item4  count4  price4  var4
5  item5  count5  price5  var5

In [61]:
pd.concat([df3, df4], join='outer')

    item   count   price   var
0  item0  count0  price0   NaN
1  item1  count1  price1   NaN
2  item2  count2  price2   NaN
3  item3  count3  price3   NaN
2  item2  count2  price2  var2
3  item3  count3  price3  var3
4  item4  count4  price4  var4
5  item5  count5  price5  var5

In [62]:
pd.concat([df3, df4], join='inner')

    item   count   price
0  item0  count0  price0
1  item1  count1  price1
2  item2  count2  price2
3  item3  count3  price3
2  item2  count2  price2
3  item3  count3  price3
4  item4  count4  price4
5  item5  count5  price5

In [63]:
df5 = pd.DataFrame({'A': ['A0', "A1", "A2"], 'B': ['B0', 'B1', 'B2'], 'C': ['C0', 'C1', 'C2'], 'D': ['D0', 'D1', 'D2']}, index=['I0','I1','I2'])
df5

     A   B   C   D
I0  A0  B0  C0  D0
I1  A1  B1  C1  D1
I2  A2  B2  C2  D2

In [64]:
df6 = pd.DataFrame({'A': ['AA2', "A3", "A4"], 'B': ['BB2', 'B3', 'B4'], 'C': ['CC2', 'C3', 'C4'], 'D': ['DD2', 'D3', 'D4']}, index=['I2','I3','I4'])
df6

      A    B    C    D
I2  AA2  BB2  CC2  DD2
I3   A3   B3   C3   D3
I4   A4   B4   C4   D4

In [65]:
pd.concat([df5,df6], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['I2'], dtype='object')

## merge/join 활용해 병합하기
merge와 join함수를 이용해 key를 기준으로 데이터 프레임을 병합

In [66]:
customer = pd.DataFrame({'customer_id' : np.arange(6),
                         'name': ['James', 'Elly','Tom','Givert','Aiden','Brody'],
                         '나이' : [40,20,21,30,31,18]})
customer

   customer_id    name  나이
0            0   James  40
1            1    Elly  20
2            2     Tom  21
3            3  Givert  30
4            4   Aiden  31
5            5   Brody  18

In [67]:
orders = pd.DataFrame({'customer_id': [1,1,2,2,2,3,3,1,4,9],
                       'item': ['마우스','충전기','이어폰','헤드셋','전자펜','키보드','전자펜','마우스','키보드','케이스'],
                       'quantity': [1,2,1,1,3,2,2,3,2,1]})
orders

   customer_id item  quantity
0            1  마우스         1
1            1  충전기         2
2            2  이어폰         1
3            2  헤드셋         1
4            2  전자펜         3
5            3  키보드         2
6            3  전자펜         2
7            1  마우스         3
8            4  키보드         2
9            9  케이스         1

In [68]:
pd.merge(customer,orders, on='customer_id')

   customer_id    name  나이 item  quantity
0            1    Elly  20  마우스         1
1            1    Elly  20  충전기         2
2            1    Elly  20  마우스         3
3            2     Tom  21  이어폰         1
4            2     Tom  21  헤드셋         1
5            2     Tom  21  전자펜         3
6            3  Givert  30  키보드         2
7            3  Givert  30  전자펜         2
8            4   Aiden  31  키보드         2

In [69]:
pd.merge(customer, orders, on='customer_id', how='inner')

   customer_id    name  나이 item  quantity
0            1    Elly  20  마우스         1
1            1    Elly  20  충전기         2
2            1    Elly  20  마우스         3
3            2     Tom  21  이어폰         1
4            2     Tom  21  헤드셋         1
5            2     Tom  21  전자펜         3
6            3  Givert  30  키보드         2
7            3  Givert  30  전자펜         2
8            4   Aiden  31  키보드         2

In [70]:
pd.merge(customer, orders, on='customer_id', how='left')

    customer_id    name  나이 item  quantity
0             0   James  40  NaN       NaN
1             1    Elly  20  마우스       1.0
2             1    Elly  20  충전기       2.0
3             1    Elly  20  마우스       3.0
4             2     Tom  21  이어폰       1.0
5             2     Tom  21  헤드셋       1.0
6             2     Tom  21  전자펜       3.0
7             3  Givert  30  키보드       2.0
8             3  Givert  30  전자펜       2.0
9             4   Aiden  31  키보드       2.0
10            5   Brody  18  NaN       NaN

In [71]:
pd.merge(customer, orders, on='customer_id', how='right')

   customer_id    name    나이 item  quantity
0            1    Elly  20.0  마우스         1
1            1    Elly  20.0  충전기         2
2            2     Tom  21.0  이어폰         1
3            2     Tom  21.0  헤드셋         1
4            2     Tom  21.0  전자펜         3
5            3  Givert  30.0  키보드         2
6            3  Givert  30.0  전자펜         2
7            1    Elly  20.0  마우스         3
8            4   Aiden  31.0  키보드         2
9            9     NaN   NaN  케이스         1

In [72]:
pd.merge(customer, orders, on='customer_id', how='outer')

    customer_id    name    나이 item  quantity
0             0   James  40.0  NaN       NaN
1             1    Elly  20.0  마우스       1.0
2             1    Elly  20.0  충전기       2.0
3             1    Elly  20.0  마우스       3.0
4             2     Tom  21.0  이어폰       1.0
5             2     Tom  21.0  헤드셋       1.0
6             2     Tom  21.0  전자펜       3.0
7             3  Givert  30.0  키보드       2.0
8             3  Givert  30.0  전자펜       2.0
9             4   Aiden  31.0  키보드       2.0
10            5   Brody  18.0  NaN       NaN
11            9     NaN   NaN  케이스       1.0

In [75]:
customer

   customer_id    name  나이
0            0   James  40
1            1    Elly  20
2            2     Tom  21
3            3  Givert  30
4            4   Aiden  31
5            5   Brody  18

In [74]:
cust1 = customer.set_index('customer_id')
cust1

               name  나이
customer_id
0             James  40
1              Elly  20
2               Tom  21
3            Givert  30
4             Aiden  31
5             Brody  18

In [77]:
orders

   customer_id item  quantity
0            1  마우스         1
1            1  충전기         2
2            2  이어폰         1
3            2  헤드셋         1
4            2  전자펜         3
5            3  키보드         2
6            3  전자펜         2
7            1  마우스         3
8            4  키보드         2
9            9  케이스         1

In [76]:
order1 = orders.set_index('customer_id')
order1

            item  quantity
customer_id
1            마우스         1
1            충전기         2
2            이어폰         1
2            헤드셋         1
2            전자펜         3
3            키보드         2
3            전자펜         2
1            마우스         3
4            키보드         2
9            케이스         1

In [87]:
pd.merge(cust1, order1, left_index=True, right_index=True)

               name  나이 item  quantity
customer_id
1              Elly  20  마우스         1
1              Elly  20  충전기         2
1              Elly  20  마우스         3
2               Tom  21  이어폰         1
2               Tom  21  헤드셋         1
2               Tom  21  전자펜         3
3            Givert  30  키보드         2
3            Givert  30  전자펜         2
4             Aiden  31  키보드         2

In [85]:
pd.merge(cust1, order1, on='customer_id')

               name  나이 item  quantity
customer_id
1              Elly  20  마우스         1
1              Elly  20  충전기         2
1              Elly  20  마우스         3
2               Tom  21  이어폰         1
2               Tom  21  헤드셋         1
2               Tom  21  전자펜         3
3            Givert  30  키보드         2
3            Givert  30  전자펜         2
4             Aiden  31  키보드         2

In [95]:
pd.merge(cust1, order1, on='customer_id', how='right').groupby('item').sum().sort_values(by='quantity', ascending=False)

             name    나이  quantity
item
전자펜     TomGivert  51.0         5
마우스      EllyElly  40.0         4
키보드   GivertAiden  61.0         4
충전기          Elly  20.0         2
이어폰           Tom  21.0         1
케이스             0   0.0         1
헤드셋           Tom  21.0         1

In [97]:
pd.merge(cust1, order1, on='customer_id', how='left')

               name  나이 item  quantity
customer_id
0             James  40  NaN       NaN
1              Elly  20  마우스       1.0
1              Elly  20  충전기       2.0
1              Elly  20  마우스       3.0
2               Tom  21  이어폰       1.0
2               Tom  21  헤드셋       1.0
2               Tom  21  전자펜       3.0
3            Givert  30  키보드       2.0
3            Givert  30  전자펜       2.0
4             Aiden  31  키보드       2.0
5             Brody  18  NaN       NaN

In [106]:
pd.merge(cust1, order1, on='customer_id', how='inner').groupby(['name', 'item']).sum()

             나이  quantity
name   item
Aiden  키보드   31         2
Elly   마우스   40         4
       충전기   20         2
Givert 전자펜   30         2
       키보드   30         2
Tom    이어폰   21         1
       전자펜   21         3
       헤드셋   21         1

In [105]:
pd.merge(cust1, order1, on='customer_id', how='inner').groupby(['name', 'item']).sum().loc['Elly']

      나이  quantity
item
마우스   40         4
충전기   20         2